; *****************************************************************************
; GetRandom — генерирует случайное 8-битное число (0..255)
;   Output: A = случайное число
;   Портит: A
; *****************************************************************************
GetRandom:
    push hl
    ld   a, (seed)          ; Загружаем текущее состояние (зерно)
    and  a                  ; Проверяем на ноль
    jr   nz, 1f
    cpl                     ; Если seed стал равен 0, превращаем его в 0xFF
                            ; (LFSR не умеет работать с чистым нулем)
1:
    rrca                    ; Циклический сдвиг вправо
    rrca                    ; Еще один сдвиг
    rrca                    ; И третий. Это перемешивает биты.
    xor  0x65               ; Применяем XOR с магической константой (маской)
white_rand EQU $        ; Технический маркер
    ld   (seed), a          ; Сохраняем новое значение для следующего вызова
    pop  hl
    ret

; Переменная для хранения состояния генератора (зерно)
; Изменяя это число при старте, вы получите новую последовательность
seed: DB 0x15               


; *****************************************************************************
Delay:
    push bc
    ld bc, 0xFFF
Delay1:
    dec bc
    ld a,b
    or c
    jr nz, Delay1
    pop bc
    ret
