; *****************************************************************************
; GetRandom — генерирует случайное 8-битное число (0..255)
;   Output: A = случайное число
;   Портит: A
; *****************************************************************************
GetRandom:
    push hl
    ld   a, (seed)          
    srl  a                  
white_rand_fix EQU $
    jr   nc, 1f             
    xor  0x8E               
1:
    ld   (seed), a          ; Сохранили новое зерно LFSR
    
    ; Подмешиваем регистр R процессора для разрушения корреляции сдвигов
    ld   hl, white_rand_fix ; Любой случайный адрес
    xor  l
    ld   l, a
    ld   a, r               ; Берем аппаратный счетчик R
    xor  l                  ; Склеиваем с LFSR
    
    pop  hl
    ret


; Переменная для хранения состояния генератора (зерно)
; Изменяя это число при старте, вы получите новую последовательность
seed: DB 0x15               


; *****************************************************************************
Delay:
    push bc
    ld bc, 0xFFF
Delay1:
    dec bc
    ld a,b
    or c
    jr nz, Delay1
    pop bc
    ret
